Terraform Plan Output:
```
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=devinfradays-amlan-blr-cw-hello-kitty-function]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=devinfradays-amlan-blr-hello-kitty-role-0928]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=66d5166c-4d82-4b1e-8667-aa3028326bf8]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=devinfradays-amlan-blr-0928]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_83b2db75-cf89-4eaa-aff6-ac4f5745923d.aws_iam_role_policy.this: Refreshing state... [id=devinfradays-amlan-blr-hello-kitty-role-0928:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=devinfradays-amlan-blr-hello-kitty-function-0928]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-devinfradays-amlan-blr-0928]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=devinfradays-amlan-blr-0928]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=devinfradays-amlan-blr-0928]
module.appcd_6f622703-c7df-4594-9771-f6009b2fd1e7.aws_iam_role_policy.this: Refreshing state... [id=devinfradays-amlan-blr-hello-kitty-role-0928:aws_s3-hello-kitty-policy]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=devinfradays-amlan-blr-0928]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "devinfradays-amlan-blr-hello-kitty-function-0928"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_lambda_devinfradays_amlan_blr_hello_kitty_function_0928_function_url     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```